{
    "class_name": "Model",
    "config": {
        "name": "model",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        5000
                    ],
                    "dtype": "string",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_1"
                },
                "name": "input_1",
                "inbound_nodes": []
            },
            {
                "class_name": "CategoricalEncoding",
                "config": {
                    "name": "categorical_encoding",
                    "trainable": true,
                    "dtype": "float32",
                    "encoding": [
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
                        "int",
